"""Два узла, находящиеся в одной сети, имеют IP-адреса 121.171.5.70 и 121.171.5.107.
Укажите наименьшее возможное количество адресов в этой сети."""

ip_comp_1 = '121.171.5.70'
ip_comp_2 = '121.171.5.107'

print(".".join(bin(int(x))[2:].zfill(8) for x in ip_comp_1.split(".")), 'ip-адрес узла 1')
print('.'.join(["********"] * 4), 'маска')
print(".".join(bin(int(x))[2:].zfill(8) for x in ip_comp_2.split(".")), 'ip-адрес узла 2')