"""Для узла с IP-адресом 215.181.200.27 адрес сети равен 215.181.192.0.
Чему равно наибольшее возможное значение третьего слева байта маски? Ответ запишите в виде десятичного числа."""

ip_comp = '215.181.200.27'
ip_net = '215.181.192.0'

print(".".join(bin(int(x))[2:].zfill(8) for x in ip_comp.split(".")), 'ip-адрес узла')
print('.'.join(["********"] * 4), 'маска')
print(".".join(bin(int(x))[2:].zfill(8) for x in ip_net.split(".")), 'адрес сети')

print(bin(200)[2:])
print(bin(192)[2:])
print(int('11110000', 2))